# IMultiServerService Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IMultiServerService Methods
IMultiServerService Interface See Also
---
The IMultiServerService type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CanExecute | Implement this to test whether a particular server should be executed. |
| Execute | Implement this method to execute the given server.  (Inherited from IExternalService.) |
| GetDescription | Implement this method to return a description of the service.  (Inherited from IExternalService.) |
| GetName | Implement this method to return the name of the service.  (Inherited from IExternalService.) |
| GetServiceId | Implement this method to return the unique Id of the service.  (Inherited from IExternalService.) |
| GetVendorId | Implement this method to return the vendor Id of the service.  (Inherited from IExternalService.) |
| IsValidServer | Implement this method to check if the given instance represents a valid server of this service.  (Inherited from IExternalService.) |
| OnServersChanged | Implement this method to handle situations when servers for the service have changed.  (Inherited from IExternalService.) |
| OnServersDisparity | Implements this method to get notified that the servers in a just opened document differ from those currently set as active for the service.  (Inherited from IExternalService.) |

# See Also
IMultiServerService Interface
Autodesk.Revit.DB.ExternalService Namespace